# ---------------------------------------------------------------
#                            تعریف متغیر
# ---------------------------------------------------------------

# # مقداردهی
# print("-------")
x_int = 2
x_float = 2.3
x_bool = False
x_str1 = "Atiye"
x_str2 = 'pooya'
x_str3 = """i am a 
alsdkfjaskldjfal
;alsdfjlasd;jdflsajkf
very long string"""

# # نوع متغیر
# print("-------")
# print("my girls  is %d years old and his name is %s" % (x_int, x_str1))
# print("my boy is {} years old and his name is {}".format(x_int, x_str2))
# print(type(x_int))
# print(type(x_str1))
# print(type(x_float))
# print(type(x_bool))
# print(isinstance(x_str3, str))

# # عملیات
# print("_____")
# print(x_int + x_float)
# print(x_int + x_str1)  # error
# print(x_str1 + x_str2)
#
# ---------------------------------------------------------------
#                            متغیرهای عددی
# ---------------------------------------------------------------
x, y, z, = 4, 3, 6
# print(x / y)  # تقسیم اعشاری
# print(type(x / y))
#
# print(x // y)  # تقسیم صحیح
# print(type(x // y))
#
# print(x % y)


# ---------------------------------------------------------------
#                            رشته‌ها
# ---------------------------------------------------------------
#
# تعریف
# print("_____")
s1 = "workshop"
s2 = 'python workshop'
s3 = """hello """
s3 = """ hello
this is a python workshop
welcome everyone
"""

# # عملیات
# print("_____")
# print( s1 + s2)
# print( s1 * 3)
# # print( s1 + x)  # error
# print( s1 + str(x))
# print( int('1234'))
# print( bool(1))
# print( float("1234.8"))
#


# دسترسی به اندیس‌ها
# print("_____")
s = 'this is a python workshop'
# print(s[0])
# print(s[-1])
# print(s[1:4])
# print(s[1:6:2])
# print(s[5:1928347])
# print(s[9:5])
# print(s[9:5:-1])



# توابع ویژه در رشته‌ها
# -------
s = 'this is a workshop. have FUNNNNNN!'
# print(s.lower())
# print(s.upper())
# print(s.split(' '))
# print(s.index('work'))
# print(s.find('work'))
# print(s.count('a'))


# ************************************************
# تمرین
# برنامه‌ای بنویسید که
# در خط اول رشته‌ی S را ورودی بگیرد.
# و در خط دوم دو کلمه‌ی S1 و S2 که با فاصله از هم جدا شده اند را از ورودی بگیرد.
# سپس زیررشته‌ای از S، که از S1 شروع شود و به S2 ختم شود را چاپ کند.
# مثال:
# S = 'salam aleikom, hale shoma chetore? che khabara?'
# S1 = 'aleikom' S2 = 'shoma'
# output = 'aleikom, hale shoma'
# ************************************************
# جواب:
# S = input()
# S1, S2 = input().split(" ")
# start, end = S.find(S1), S.find(S2) + len(S2)
# print(S[start:end])
# ************************************************


# ---------------------------------------------------------------
#                     ساختارهای شرطی و حلقه
# ---------------------------------------------------------------
#
# # شرط
# # --------
# s = 'salam aleikom, aleikomossalam'
# if len(s) < 20:
#     pass
# elif len(s) < 30:
#     print("s is kinda short")
# else:
#     print("s isn't short")


# # حلقه
# # --------
#
# 1: while
# i = 1
# while i < 10:
#     print(i)
#     i += 1
#
# # 2: for
# # ۱: روی آرایه
# s = 'python workshop'
# for char in s:
#     print(char, end=":")
#
# # ۲: روی iterable
# for i in range(0, 10):
#     print(i, end="/")
#
# for i in range(10):
#     if i % 2 == 0:
#         continue
#     print(i)
#
# for i in range(9, -1, -1):
#     print(i)

# ************************************************
# تمرین
# برنامه‌ای بنویسید که دو رشته با طول برابر دریافت کند
# به عنوان خروجی رشته‌ای شامل حروف بزرگتر هر جایگاه را چاپ کند
# ************************************************
# ************************************************

# # جواب:
# x, y = input(), input()
# output = ""

# ## 1
# for i in range(len(x)):
#     output += x[i] if x[i] > y[i] else y[i]

# ************************************************
# ************************************************


# ---------------------------------------------------------------
#                            لیست‌ها
# ---------------------------------------------------------------

# # تعریف
# # -------
l = [1, 6, -4, 4.2, 19 + 2j, 'workshop']
l[1] = 123  # no error\
# print(l)

# # چند تابع کاربردی
# # ------------
#
# # ۱: اضافه کردن به لیست
l.append(100)
# print(l)
l.insert(5,201)
# print(l)
l += [1, 7, 2, 2, 2]
l.extend([5, 12])
# print(l)
l.append([5, 12])
# print(l)

# # ۲: حذف کردن از لیست
l.remove(19 + 2j)
l.pop(5)
# print(l)

"""good syntax """
#reverse
# l.sort()
# print(l)
# l.reverse()
# print(l)
# print(l.count(1))
# l.sort(reverse=True)
# print(l)


# # مسائل عجیب در لیست‌ها!
# # -------------------

# # ۱: کپی کردن
# l1 = l
# l1[0] = 12309
# print(l1)
# print(l)  # !!!!

# l1 = l.copy()
# l1[0] = 394
# print(l1)
# print(l)  # ^_^


# # ۲: مقداردهی اولیه

a = [0]*10
# print(a)
a[0] = a[2] = a[4] = a[6] = a[8] = 12
# print(a)

a = [1 , 2 , 3] *4
# print(a)
a[1] = 123
# print(a)

a = [[0]*4]*3
# print(a)
a[2][2] = 123
# print(a)

a = [[0 for i in range(4)] for j in range(4)]
# print(a)
a[3][3] = 123
# print(a)



# ************************************************
# تمرین
# برنامه‌ای بنویسید که در دو خط، دو آرایه‌ی n بعدی از ورودی بگیرد.
# در خروجی یک آرایه‌ی دوبعدی n در 2 از آن بسازد
# ************************************************

# ************************************************
# جواب:
# a = list(map(int, input().split(" ")))
# b = list(map(int, input().split(" ")))

# 1
# output = []
# for (ai, bi) in zip(a, b):
#     output += [[ai, bi]]

# 2
# output = []
# for (ai, bi) in zip(a, b):
#     output.append([ai, bi])

# ************************************************
# ************************************************


# ---------------------------------------------------------------
#                   چند‌تایی‌های مرتب، مجموعه‌ها و دیکشنری
# ---------------------------------------------------------------

# چندتایی‌های مرتب: لیست غیرقابل تغییر
# # ----------------------------
# z = (10, 9, 8)  # کاربردش را بعدا خواهیم دید
#
# print(z[0])
# print(z[-1])

# مجموعه‌ها: لیست‌ با اعضاء متمایز
# # ------------------------
# s = {1, 2, 3, 3, 3, 3, (1, 2), "helloooooo"}
# print(s)
# print(4 in s)
# print(3 in s)
#
# # ۱: اضافه کردن به مجموعه
# s.add(54)
# print(s)
#
# # ۲. حذف کردن از مجموعه
# s.remove(3)
# print(s)
#
# # دیکشنری
# # ------
# a = {'salam': 'hello',
#      40124: 'madaar',
#      (1, 2, 3): [2, 4, 6],
#      1: 10,
#      'salam': 'hi'}
#
# for key, value in a.items():
#     print(key, ":", value)
#
# # اضافه کردن به دیکشنری
# a['khodafez'] = 'bye'
# print(a)


# ************************************************
# تمرین
# برنامه‌ای بنویسید که معکوس یک دیکشنری را بدست بیاورد
# سپس از روی طول آن بفهمد که تابع نگاشت یک به یک بوده یا نه
# ************************************************
# ************************************************

# # جواب:
# a = {3: 9, -3: 9, 4: 16, 5: 25, 2: 4, -2: 4}
#
# # 1
# b = {}
# for key, value in a.items():
#     b[value] = key

# ************************************************
# ************************************************
# تمرین
# برنامه‌ای بنویسید که تعدادی اسم و فامیل از ورودی بخواند
# سپس تشخیص بدهد در هر فامیل چند نفر متمایز هستند.
# ************************************************
# ************************************************

# # جواب:
# names = [['shabnam', 'sheikhha'], ['sheida', 'sheikhha'], ['abbas', 'sheikhha'], ['maria', 'faghihi']]
# count = {}
# for name, family in names:
#     if family in count:
#         count[family] += 1
#     else:
#         count[family] = 1
# print(count)

